In [1]:
import cx_Oracle
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

In [2]:
# 오라클 커넥션 연결, ai6 계정으로 XE 사용
conn = cx_Oracle.connect('ai6/1234@127.0.0.1:1521/XE')
cursor = conn.cursor()

In [3]:
# 테이블 삭제
cursor.execute('''
  DROP TABLE book
''')

In [4]:
# 커서를 통해 테이블 만들기
cursor.execute('''
CREATE TABLE book(
  no    NUMBER(7)      NOT NULL PRIMARY KEY,
  name  VARCHAR(32) NOT NULL, 
  phone VARCHAR(32) NOT NULL, 
  email VARCHAR(64) NOT NULL,
  rdate DATE NOT NULL
)
''')

# cursor.close()
# conn.close()
# auto_increment -> 삭제
# datetime -> date

In [5]:
# 시퀀스 삭제
# cursor.execute('DROP SEQUENCE book_seq') # 시퀀스 충돌문제로 시퀀스 사용 안함

In [6]:
# 시퀀스 만들기
# cursor.execute('''
# CREATE SEQUENCE book_seq
#   START WITH 1
#   INCREMENT BY 1
#   MAXVALUE 9999999
#   CACHE 2
#   NOCYCLE
# ''')

In [7]:
# 등록
# %s 대신에 :칼럼이름을 사용한다.
sql = '''
INSERT INTO book (no, name, phone, email, rdate) 
VALUES(book_seq.nextval, :name, :phone, :email, sysdate)
''' 
result = cursor.execute(sql, ('홍길순', '021-322-1542', 'mail2@mail.com'))
print('result:', result) # none: 정상처리, exception: 에러

result = cursor.execute(sql, ('나길순', '021-322-1542', 'mail3@mail.com'))
print('result:', result)

result = cursor.execute(sql, ('다길순', '021-322-1542', 'mail3@mail.com'))
print('result:', result)

conn.commit()

result: None
result: None
result: None

In [8]:
import numpy as np

In [9]:
# 목록
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)

rows = cursor.fetchall() # 모든 레코드의 산출

print(type(rows)) # list
print(np.array(rows).shape) # 3,5
print(rows)

for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

<class 'list'>
(3, 5)
[(1, '홍길순', '021-322-1542', 'mail2@mail.com', datetime.datetime(2020, 6, 26, 11, 59, 12)), (2, '나길순', '021-322-1542', 'mail3@mail.com', datetime.datetime(2020, 6, 26, 11, 59, 12)), (3, '다길순', '021-322-1542', 'mail3@mail.com', datetime.datetime(2020, 6, 26, 11, 59, 12))]
NO: 1, NAME: 홍길순, PHONE: 021-322-1542, EMAIL: mail2@mail.com rdate:2020-06-26 11:59:12
NO: 2, NAME: 나길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:59:12
NO: 3, NAME: 다길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:59:12

In [10]:
# 한건의 레코드 조회
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  WHERE no=:no
'''
cursor.execute(sql, (1,)) # 튜플로 인식을 시켜줘야 함, 그래서 반드시 뒤에 컴마가 있어야 함

row = cursor.fetchone() # 하나의 레코드 산출
print(type(row))
print(row)

<class 'tuple'>
(1, '홍길순', '021-322-1542', 'mail2@mail.com', datetime.datetime(2020, 6, 26, 11, 59, 12))

In [11]:
# 한 건의 레코드 복합 조회
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  WHERE no=:no and name=:name
'''
cursor.execute(sql, (1 ,'홍길순'))

row = cursor.fetchone() # 하나의 레코드 산출
if row != None:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))
else:
    print('일치하는 레코드가 없습니다.')

NO: 1, NAME: 홍길순, PHONE: 021-322-1542, EMAIL: mail2@mail.com rdate:2020-06-26 11:59:12

In [12]:
# 수정, 업데이트
sql='''
  UPDATE book 
  SET name=:name, phone=:phone, email=:email, rdate=sysdate 
  WHERE no=:no
'''
cursor.execute(sql, ('왕눈이', '010-123-1234', 'mail10@mail.com', 1))
conn.commit()

sql='''
  SELECT no, name, phone, email, rdate
  FROM book
  WHERE no=:no
'''
cursor = conn.cursor() # commit() 실행 후에는 cursor를 다시 가져올 것.
cursor.execute(sql, (1,)) # 튜플로 전달

row = cursor.fetchone() # 하나의 레코드 산출
print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

NO: 1, NAME: 왕눈이, PHONE: 010-123-1234, EMAIL: mail10@mail.com rdate:2020-06-26 11:59:17

In [13]:
# 삭제
sql='''
  DELETE FROM book
  WHERE no=:no
'''
cursor.execute(sql, (1,))
conn.commit()

cursor = conn.cursor() # commit() 실행 후에는 cursor를 다시 가져올 것.
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

NO: 2, NAME: 나길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:59:12
NO: 3, NAME: 다길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:59:12

In [14]:
cursor.close()
conn.close()

In [15]:
# 오라클 -> DataFrame
# 오라클 커넥션 연결, ai6 계정으로 XE 사용
conn = cx_Oracle.connect('ai6/1234@127.0.0.1:1521/XE')

# 목록
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''

df = pd.read_sql(sql, conn)

conn.close()

df

   NO NAME         PHONE           EMAIL               RDATE
0   2  나길순  021-322-1542  mail3@mail.com 2020-06-26 11:59:12
1   3  다길순  021-322-1542  mail3@mail.com 2020-06-26 11:59:12

In [22]:
# 오라클 모든 레코드 삭제
# 오라클 커넥션 연결, ai6 계정으로 XE 사용
conn = cx_Oracle.connect('ai6/1234@127.0.0.1:1521/XE')

sql='''
  DELETE FROM book
'''

cursor = conn.cursor()

cursor.execute(sql)
conn.commit()

cursor = conn.cursor() # commit() 실행 후에는 cursor를 다시 가져올 것.
sql = '''
  SELECT no, name, phone, email
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} ".format(row[0], row[1], row[2], row[3]))

cursor.close()
conn.close()

In [16]:
# no의 가장 큰 값 구하기
max_val= max(df['NO']) # 대소문자 구분, Oracle은 내부적으로 칼럼명을 대문자로 저장
max_val

3

In [17]:
# DataFrame에 1명의 주소를 추가할 것
# 칼럼명 대문자로 표가하지 않으면 새로운 컬럼이 많이 생성됨
new_row = {'NO':max_val+1, 'NAME':'아로미', 'PHONE':'000-1111-1111', \
           'EMAIL':'mail7@mail.com', 'RDATE':'2020-06-25 17:00:00'}
df = df.append(new_row, ignore_index=True)
df

   NO NAME          PHONE           EMAIL                RDATE
0   2  나길순   021-322-1542  mail3@mail.com  2020-06-26 11:59:12
1   3  다길순   021-322-1542  mail3@mail.com  2020-06-26 11:59:12
2   4  아로미  000-1111-1111  mail7@mail.com  2020-06-25 17:00:00

In [18]:
# 오라클 datetime 형식으로 변환
df['RDATE'] = pd.to_datetime(df['RDATE'])
df

   NO NAME          PHONE           EMAIL               RDATE
0   2  나길순   021-322-1542  mail3@mail.com 2020-06-26 11:59:12
1   3  다길순   021-322-1542  mail3@mail.com 2020-06-26 11:59:12
2   4  아로미  000-1111-1111  mail7@mail.com 2020-06-25 17:00:00

In [23]:
# pandas -> oracle 저장
# database 이름: XE
engine = create_engine('oracle+cx_oracle://ai6:1234@localhost:1521/?service_name=XE', echo=False)
df.to_sql(name='book', con=engine, if_exists='append', index=False)

In [25]:
# 등록 확인
# 오라클 커넥션 연결, ai6 계정으로 XE 사용
conn = cx_Oracle.connect('ai6/1234@127.0.0.1:1521/XE')
cursor = conn.cursor()

sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)

rows = cursor.fetchall() # 모든 레코드의 산출

for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))
    
cursor.close()
conn.close()

NO: 2, NAME: 나길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:59:12
NO: 3, NAME: 다길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:59:12
NO: 4, NAME: 아로미, PHONE: 000-1111-1111, EMAIL: mail7@mail.com rdate:2020-06-25 17:00:00